# QTCloseMovieFile

## Description
Closes the specified QuickTime movie file.

```pascal
PROCEDURE QTCloseMovieFile(movieRef : INTEGER);
```

```python
def vs.QTCloseMovieFile(movieRef):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|movieRef|INTEGER|Index of QuickTime movie stream.|

## Version
Availability: from VectorWorks8.5

## Category
* Special - QuickTime